## 01 Area of Circle

In [7]:
import numpy as np
import pandas as pd
import math as m

r = float(input("Please Enter the Radius:"))
area = m.pi*(r**2)

print("The Area is:",area)

Please Enter the Radius:6
The Area is: 113.09733552923255

## 02 Function for Comparison

In [9]:
n1 = int(input("Enter the First Number:"))
n2 = int(input("Enter the Second Number:"))
n3 = int(input("Enter the Third Number:"))

if n1>n2 and n1>n3:
    largest = n1
elif n2>n1 and n2>n3:
    largest = n2
else:
    largest = n3

print("The Largest Number is:",largest)

Enter the First Number:8
Enter the Second Number:7
Enter the Third Number:6
The Largest Number is: 8

## 03 Convert Vowels in 1 and Consonants in 0

In [11]:
def convert_vowels(input_string):
    vowels = "aeiou"
    output_string = ""
    for char in input_string:
        if char.lower() in vowels:
            output_string  += "1"
        else:
            output_string += "0"
    return output_string

input_string = input("Enter the Word:")
output_string = convert_vowels(input_string)
print("The Output is:",output_string)

Enter the Word:abcde
The Output is: 10001

## 04 Calculator

In [12]:
a = float(input("Please enter the 1st value: "))
b = float(input("Please enter the 2nd value: "))

ADD = a+b
print("The addition is:",ADD)

SUB = a-b
print("The substraction is:",SUB)

MUL = a*b
print("The multiplication is:",MUL)

DIV = a/b
print("The division is:",DIV)

Please enter the 1st value: 2
Please enter the 2nd value: 4
The addition is: 6.0
The substraction is: -2.0
The multiplication is: 8.0
The division is: 0.5

## 05 String Iterate

In [14]:
string = (input("Please Enter the Input:"))
result = string*2
print("The Output is:",result)

Please Enter the Input:ok
The Output is: okok

## 06 Filter, Map and Reduce Function

In [20]:
input_list = [ "ux1P5", "rt0", "ft3", "z1aP" ]

output_list1 = list(filter(lambda x: "P" in x,input_list))
print("First Output is:",output_list1)

output_list2 = list(map(lambda x: x+"P" if "P" not in x else x,input_list))
print("Second Output is:",output_list2)

First Output is: ['ux1P5', 'z1aP']
Second Output is: ['ux1P5', 'rt0P', 'ft3P', 'z1aP']

In [22]:
from functools import reduce
input_list = [1,2,3,4,5,6]
output1 = reduce(lambda x, y:x+y, input_list)
print("First Result is:",output1)

First Result is: 21

In [24]:
input_list = [1,2,3,4,5,6]
output = sum(input_list)
print("The result is:",output)

The result is: 21

## 07 Dataset

In [27]:
wine = pd.read_csv("datasets/wine.csv")
wine.head(10)

,Unnamed: 0,item_code,item_name,display_level,selectable,sort_sequence
0,0,AA0,All items - old base,0,T,2
1,1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,2,SA0,All items,0,T,1
3,3,SA0E,Energy,1,T,375
4,4,SA0L1,All items less food,1,T,359
5,5,SA0L12,All items less food and shelter,1,T,362
6,6,SA0L12E,"All items less food, shelter, and energy",1,T,363
7,7,SA0L12E4,"All items less food, shelter, energy, and used...",1,T,364
8,8,SA0L1E,All items less food and energy,1,T,360
9,9,SA0L2,All items less shelter,1,T,361

In [28]:
wine.iloc[6,-1]

363

In [29]:
wine1 = wine.iloc[0:10]
wine1

,Unnamed: 0,item_code,item_name,display_level,selectable,sort_sequence
0,0,AA0,All items - old base,0,T,2
1,1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,2,SA0,All items,0,T,1
3,3,SA0E,Energy,1,T,375
4,4,SA0L1,All items less food,1,T,359
5,5,SA0L12,All items less food and shelter,1,T,362
6,6,SA0L12E,"All items less food, shelter, and energy",1,T,363
7,7,SA0L12E4,"All items less food, shelter, energy, and used...",1,T,364
8,8,SA0L1E,All items less food and energy,1,T,360
9,9,SA0L2,All items less shelter,1,T,361

In [ ]:
wine1.to_pickle('datasets/wine_pickle.pkl')
wine2 =  pd.read_pickle('datasets/wine_pickle.pkl')
wine2